espressif/esp-idf/components/newlib/test_apps/newlib/sdkconfig.ci.release_esp32c2
CONFIG_IDF_TARGET="esp32c2"
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT=y

# C2 specific moved from old C2 default config
CONFIG_LIBC_TIME_SYSCALL_USE_NONE=n
CONFIG_LIBC_TIME_SYSCALL_USE_HRT=y
CONFIG_LIBC_TIME_SYSCALL_USE_RTC=n
CONFIG_LIBC_TIME_SYSCALL_USE_RTC_HRT=n
